auto_model_generation.org
#+title: Automating rote model creation from real JSON

** Introduction
As a developer, you may come across a situation where you need to generate fake data for unit tests, but the data must be structured and complex enough to accurately mimic real-world data. The traditional approach of manually generating fake data, or even something that's partially automated (faker for instance) can be time-consuming and inefficient, especially when dealing with large and complex datasets, particularly nested data. This blog post will show you how to use the Python ecosystem to generate usable models and their associated test from real-world JSON data in a scalable and efficient manner. We will use datamodel-codegen and pydantic-factories to generate mock data.

The code examples (and this .org file itself, how very meta) are available on github [[https://github.com/ahonnecke/auto_model_generation][Public repository for automatic model generation example project]]

** Create models with datamodel-codegen
The first step is to get an example of the JSON data that you want to mock. For this example, let's assume an extremely trivial case in which we have a JSON file with data about customers that we want to mock for unit testing. We will look at how to use the datamodel-code-generator to generate a pydantic model from this JSON file.  This is not really representative of any sort of real world usage; there's little reason to build an object to contain one string.  We're focusing on the process in this step.

*** Grab an example of real word data
We are going to use a very simple json blob. To reiterate: this is overly simple for demonstration purposes.  If our data were really this trivial, we would not see much usefulness in automating the process.  In actual usage you will likely want to grab this from your logs or listen into a data stream to get a full payload.

#+begin_src json
{
    "name": "Chester Tester",
    "email": "chester@test.com",
    "role": "code monkey",
    "customerId": 1
}
#+end_src

*** Install python utilities

To install datamodel-code-generator, run the following command:

#+begin_src bash
pip install datamodel-code-generator
#+end_src

Once you have installed datamodel-code-generator, run the following command to generate a pydantic model from your JSON file:

*** Generate the python model
I'm providing the flags that I generally start with, but the utility supports many other options and formats.

#+begin_src bash
datamodel-codegen \
    --input customer.json \
    --output customer_model.py \
    --input-file-type json \
    --snake-case-field \
    --allow-population-by-field-name \
    --class-name Customer
#+end_src

these flags are used to specify the input and output files, define the input file type, and customize the output code by converting field names to snake_case, allowing population by field name, and specifying the name of the generated class.

    - --input customer.json: This flag specifies the input file for the command, which in this case is customer.json.
    - --output customer_model.py: This flag specifies the output file for the command, which in this case is customer_model.py.
    - --input-file-type json: This flag specifies the type of input file being used, which in this case is JSON.
    - --snake-case-field: This flag tells the code generator to convert all field names to snake_case in the output code.
    - --allow-population-by-field-name: This flag allows the generated code to populate the model fields using field names, rather than using positional arguments.
    - --class-name Customer: This flag specifies the name of the generated class in the output code, which in this case is Customer.

This will generate a pydantic model named "Customer" in a file named "customer_model.py".  Of note, the incoming data is in camel case (which is not generally considered "pythonic", so we have added flags to rectify that; however, we should expect incoming data to be in camel case, so the model needs to support incoming camel case), this is reflected in the field alias below.

#+begin_src python
from __future__ import annotations

from pydantic import BaseModel, Field


class Customer(BaseModel):
    class Config:
        allow_population_by_field_name = True

    name: str
    email: str
    role: str
    customer_id: int = Field(..., alias='customerId')
#+end_src

