auto_model_generation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-23 Thu 15:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Automating rote model creation from real JSON</title>
<meta name="author" content="Ashton Honnecke" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Automating rote model creation from real JSON</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6b56029">1. Introduction</a></li>
<li><a href="#org2e788e4">2. Create models with datamodel-codegen</a>
<ul>
<li><a href="#org95160c4">2.1. Grab an example of real word data</a></li>
<li><a href="#org792834e">2.2. Install python utilities</a></li>
<li><a href="#orgc723117">2.3. Generate the python model</a></li>
<li><a href="#orga504cf0">2.4. Update the python model, by automating the generation</a></li>
<li><a href="#org2cfa3de">2.5. Create a factory</a>
<ul>
<li><a href="#orgf37fd6e">2.5.1. Install packages</a></li>
<li><a href="#org3a1cf60">2.5.2. Write a Factory Class</a></li>
<li><a href="#orgbed5573">2.5.3. Use the Factory Class in Unit Tests</a></li>
<li><a href="#orgd485f5f">2.5.4. Run the tests</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgec5efab">3. Applying shape to the data with faker</a></li>
<li><a href="#org61faeef">4. Benefits of Using Mock Data</a></li>
<li><a href="#org2df73b7">5. I was promised complex data</a>
<ul>
<li><a href="#org43ea16a">5.1. Bonus model</a></li>
</ul>
</li>
<li><a href="#org3b68375">6. Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6b56029" class="outline-2">
<h2 id="org6b56029"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
As a developer, you may come across a situation where you need to generate fake data for unit tests, but the data must be structured and complex enough to accurately mimic real-world data. The traditional approach of manually generating fake data, or even something that&rsquo;s partially automated (faker for instance) can be time-consuming and inefficient, especially when dealing with large and complex datasets, particularly nested data. This blog post will show you how to use the Python ecosystem to generate usable models and their associated test from real-world JSON data in a scalable and efficient manner. We will use datamodel-codegen and pydantic-factories to generate mock data.
</p>

<p>
The code examples (and this .org file itself, how very meta) are available on github <a href="https://github.com/ahonnecke/auto_model_generation">Public repository for automatic model generation example project</a>
</p>
</div>
</div>

<div id="outline-container-org2e788e4" class="outline-2">
<h2 id="org2e788e4"><span class="section-number-2">2.</span> Create models with datamodel-codegen</h2>
<div class="outline-text-2" id="text-2">
<p>
The first step is to get an example of the JSON data that you want to mock. For this example, let&rsquo;s assume an extremely trivial case in which we have a JSON file with data about customers that we want to mock for unit testing. We will look at how to use the datamodel-code-generator to generate a pydantic model from this JSON file.  This is not really representative of any sort of real world usage; there&rsquo;s little reason to build an object to contain one string.  We&rsquo;re focusing on the process in this step.
</p>
</div>

<div id="outline-container-org95160c4" class="outline-3">
<h3 id="org95160c4"><span class="section-number-3">2.1.</span> Grab an example of real word data</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We are going to use a very simple json blob. To reiterate: this is overly simple for demonstration purposes.  If our data were really this trivial, we would not see much usefulness in automating the process.  In actual usage you will likely want to grab this from your logs or listen into a data stream to get a full payload.
</p>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #bbc2cf; background-color: #282c34;">{</span>
    <span style="color: #51afef;">"name"</span>: <span style="color: #98be65;">"Chester Tester"</span>,
    <span style="color: #51afef;">"email"</span>: <span style="color: #98be65;">"chester@test.com"</span>,
    <span style="color: #51afef;">"role"</span>: <span style="color: #98be65;">"code monkey"</span>,
    <span style="color: #51afef;">"customerId"</span>: <span style="color: #a9a1e1;">1</span>
<span style="color: #bbc2cf; background-color: #282c34;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org792834e" class="outline-3">
<h3 id="org792834e"><span class="section-number-3">2.2.</span> Install python utilities</h3>
<div class="outline-text-3" id="text-2-2">
<p>
To install datamodel-code-generator, run the following command:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef; font-weight: bold;">pip</span> install datamodel-code-generator
</pre>
</div>

<p>
Once you have installed datamodel-code-generator, run the following command to generate a pydantic model from your JSON file:
</p>
</div>
</div>

<div id="outline-container-orgc723117" class="outline-3">
<h3 id="orgc723117"><span class="section-number-3">2.3.</span> Generate the python model</h3>
<div class="outline-text-3" id="text-2-3">
<p>
I&rsquo;m providing the flags that I generally start with, but the utility supports many other options and formats.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef; font-weight: bold;">datamodel-codegen</span> <span style="color: #98be65;">\</span>
    <span style="color: #a9a1e1;">--input</span> customer.json <span style="color: #98be65;">\</span>
    <span style="color: #a9a1e1;">--output</span> customer_model.py <span style="color: #98be65;">\</span>
    <span style="color: #a9a1e1;">--input-file-type</span> json <span style="color: #98be65;">\</span>
    <span style="color: #a9a1e1;">--snake-case-field</span> <span style="color: #98be65;">\</span>
    <span style="color: #a9a1e1;">--allow-population-by-field-name</span> <span style="color: #98be65;">\</span>
    <span style="color: #a9a1e1;">--class-name</span> Customer
</pre>
</div>

<p>
these flags are used to specify the input and output files, define the input file type, and customize the output code by converting field names to snake<sub>case</sub>, allowing population by field name, and specifying the name of the generated class.
</p>

<ul class="org-ul">
<li>&#x2013;input customer.json: This flag specifies the input file for the command, which in this case is customer.json.</li>
<li>&#x2013;output customer<sub>model.py</sub>: This flag specifies the output file for the command, which in this case is customer<sub>model.py</sub>.</li>
<li>&#x2013;input-file-type json: This flag specifies the type of input file being used, which in this case is JSON.</li>
<li>&#x2013;snake-case-field: This flag tells the code generator to convert all field names to snake<sub>case</sub> in the output code.</li>
<li>&#x2013;allow-population-by-field-name: This flag allows the generated code to populate the model fields using field names, rather than using positional arguments.</li>
<li>&#x2013;class-name Customer: This flag specifies the name of the generated class in the output code, which in this case is Customer.</li>
</ul>

<p>
This will generate a pydantic model named &ldquo;Customer&rdquo; in a file named &ldquo;customer<sub>model.py</sub>&rdquo;.  Of note, the incoming data is in camel case (which is not generally considered &ldquo;pythonic&rdquo;, so we have added flags to rectify that; however, we should expect incoming data to be in camel case, so the model needs to support incoming camel case), this is reflected in the field alias below.
</p>
</div>
</div>
