auto_model_generation.org
*** Update the python model, by automating the generation


Data changes, and it's reasonable to expect that any payload will grow and evolve over time, as such, our models should be able to grow and change with the upstream changes.  I'm lazy (see this post for evidence!) and I don't want to do anything more than once, so in order to support rapid, arbitrary and capricious changes, I like to script the model creation!  This has the additional benefit of documenting the options used for future reference.

The following script references a json blob in the fixtures directory (which can also be used in other tests), and when executed, will populate (or repopulate) a model called BaseCustomer that can be extended (and doing so is recommended because it gives use the ability to regenerate the models easily and as needed). Bonus activity: you can put this script it your CI process and have it run, and then fail if the model output is different.

The following bash script has a reusable function that can be reused on multiple models by adding another call to a different fixture.

Model generation script:

#+begin_src bash /generate.sh
#!/usr/bin/env bash

generate() {
    datamodel-codegen \
        --input '$1' \
        --input-file-type json \
        --class-name '$2' \
        --snake-case-field \
        --allow-population-by-field-name \
        --output '$3'
}

generate "customer.json" "BaseCustomer" "base_customer.py"
#+end_src

The following code block has both the base and customer object in the same file, this is not very compatible with the above script that regenerates the file

#+begin_src python
from __future__ import annotations

from pydantic import BaseModel, Field

class BaseCustomer(BaseModel):
    class Config:
        allow_population_by_field_name = True

    name: str
    email: str
    role: str
    customer_id: int = Field(..., alias='customerId')
#+end_src

#+begin_src python
from base_customer import BaseCustomer

class Customer(BaseCustomer):
    """Extend the auto gen customer; this is where customization goes, manuan changes here will persist."""
    pass
#+end_src

*** Create a factory
**** Install packages
Next, we need to install pydantic-factories, which is a package that provides a factory function for generating mock data for pydantic models.

To install pydantic-factories, run the following command:

#+begin_src bash
pip install pydantic-factories
#+end_src

**** Write a Factory Class
Now that we have our pydantic model and the pydantic-factories package, we can write a factory function that will generate mock data for our model.  The pydantic factories library will take a pydantic model and build mock instances that conform to the data types in the model.

Here is an example factory function that generates a random customer:

#+begin_src python
from customer_model import Customer
from pydantic_factories import ModelFactory

class MockCustomerFactory(ModelFactory):
    __model__ = Customer
#+end_src

As you can see, this is almost entirely boilerplate, the factory class name and the model class name are the only changes required. This factory function will generate a new mock Customer instance with a random value for each class member every time it is called.

**** Use the Factory Class in Unit Tests
On to the meat of the process.  This is the point of the process.

To use our factory function in unit tests, we need to add it to our conftest.py file. The conftest.py file is a shared space for fixtures, so all the unit tests have access to the faked models, simple by adding the fixture name to the fuction signature.

Here is an example conftest.py file that defines a fixture named "customer":

#+begin_src python
import pytest

from customer_factory import MockCustomerFactory

@pytest.fixture
def customer():
    return MockCustomerFactory.build()
#+end_src

Now we can use the "customer" fixture in our unit tests to generate an arbitrary number of Customer instances with random data.

Here is an example test case that uses the "customer" fixture to generate 10 Customer instances:

**** Run the tests

#+begin_src python
def test_generate_customers(customer):
    customers = [customer for _ in range(25)]
    assert len(customers) == 25
    breakpoint()
#+end_src

#+begin_src bash
ahonnecke@antonym:~/src/blog/mocking_json$ pytest .
================== test session starts ==================
test_customer.py
> /home/ahonnecke/src/blog/mocking_json/test_customer.py(19)test_customer()->None
-> breakpoint()
(Pdb) print(customers)
[
    Customer(
        name="aopjSxhgSTqWATggcDml",
        email="LzDicaTzPTgxHPEOyhFy",
        role="otJqpbeNjjRFSdvcoaWO",
        customer_id=1896,
    ),
    Customer(
        name="nvqooVXmZVzaYPWKZgSz",
        email="PBDygYKPQGZMLTbHFCVb",
        role="eDGHYCsSxchsKNwdcVDR",
        customer_id=5242,
    ),
    Customer(
        name="lDcjZAQarzSrReNAtCCB",
        email="QaTevLqUWPgsBSSvsthM",
        role="iAdOjDkrjZsBmFTamHwf",
        customer_id=9581,
    ),
    Customer(
        name="pfXuKloegkcnsDeAQKxx",
        email="ifaWVKWTpJMIukaJtJfV",
        role="NElmZelZqHupYuqVvIZf",
        customer_id=7674,
    ),
    Customer(
        name="EvAMzosabwOrKcXEsMjr",
        email="IXNVyOElYOCwwJLeTBmD",
        role="YNxfpRclnbLNNUSRJJRN",
        customer_id=6280,
    ),
]
(Pdb)
#+end_src

Performing some trivial inspection of the resulting array of objects yields some populated data with sane-ish defaults:
This gives us an arbitrary number of objects, with differing, albeit nonsensical data.


