auto_model_generation.html

<div id="outline-container-orga504cf0" class="outline-3">
<h3 id="orga504cf0"><span class="section-number-3">2.4.</span> Update the python model, by automating the generation</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Data changes, and it&rsquo;s reasonable to expect that any payload will grow and evolve over time, as such, our models should be able to grow and change with the upstream changes.  I&rsquo;m lazy (see this post for evidence!) and I don&rsquo;t want to do anything more than once, so in order to support rapid, arbitrary and capricious changes, I like to script the model creation!  This has the additional benefit of documenting the options used for future reference.
</p>

<p>
The following script references a json blob in the fixtures directory (which can also be used in other tests), and when executed, will populate (or repopulate) a model called BaseCustomer that can be extended (and doing so is recommended because it gives use the ability to regenerate the models easily and as needed). Bonus activity: you can put this script it your CI process and have it run, and then fail if the model output is different.
</p>

<p>
The following bash script has a reusable function that can be reused on multiple models by adding another call to a different fixture.
</p>

<p>
Model generation script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #5B6268;">#!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #5B6268;"> bash</span>

<span style="color: #c678dd;">generate</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef; font-weight: bold;">datamodel-codegen</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--input</span> <span style="color: #98be65;">'$1'</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--input-file-type</span> json <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--class-name</span> <span style="color: #98be65;">'$2'</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--snake-case-field</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--allow-population-by-field-name</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--output</span> <span style="color: #98be65;">'$3'</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef; font-weight: bold;">generate</span> <span style="color: #98be65;">"customer.json"</span> <span style="color: #98be65;">"BaseCustomer"</span> <span style="color: #98be65;">"base_customer.py"</span>
</pre>
</div>

<p>
The following code block has both the base and customer object in the same file, this is not very compatible with the above script that regenerates the file
</p>
</div>
</div>

<div id="outline-container-org2cfa3de" class="outline-3">
<h3 id="org2cfa3de"><span class="section-number-3">2.5.</span> Create a factory</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgf37fd6e" class="outline-4">
<h4 id="orgf37fd6e"><span class="section-number-4">2.5.1.</span> Install packages</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Next, we need to install pydantic-factories, which is a package that provides a factory function for generating mock data for pydantic models.
</p>

<p>
To install pydantic-factories, run the following command:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #51afef; font-weight: bold;">pip</span> install pydantic-factories
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a1cf60" class="outline-4">
<h4 id="org3a1cf60"><span class="section-number-4">2.5.2.</span> Write a Factory Class</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
Now that we have our pydantic model and the pydantic-factories package, we can write a factory function that will generate mock data for our model.  The pydantic factories library will take a pydantic model and build mock instances that conform to the data types in the model.
</p>

<p>
Here is an example factory function that generates a random customer:
</p>

<p>
As you can see, this is almost entirely boilerplate, the factory class name and the model class name are the only changes required. This factory function will generate a new mock Customer instance with a random value for each class member every time it is called.
</p>
</div>
</div>

<div id="outline-container-orgbed5573" class="outline-4">
<h4 id="orgbed5573"><span class="section-number-4">2.5.3.</span> Use the Factory Class in Unit Tests</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
On to the meat of the process.  This is the point of the process.
</p>

<p>
To use our factory function in unit tests, we need to add it to our conftest.py file. The conftest.py file is a shared space for fixtures, so all the unit tests have access to the faked models, simple by adding the fixture name to the fuction signature.
</p>

<p>
Here is an example conftest.py file that defines a fixture named &ldquo;customer&rdquo;:
</p>

<p>
Now we can use the &ldquo;customer&rdquo; fixture in our unit tests to generate an arbitrary number of Customer instances with random data.
</p>

<p>
Here is an example test case that uses the &ldquo;customer&rdquo; fixture to generate 10 Customer instances:
</p>
</div>
</div>

<div id="outline-container-orgd485f5f" class="outline-4">
<h4 id="orgd485f5f"><span class="section-number-4">2.5.4.</span> Run the tests</h4>
<div class="outline-text-4" id="text-2-5-4">
<div class="org-src-container">
<pre class="src src-bash">ahonnecke@antonym:~/src/blog/mocking_json<span style="color: #51afef;">$</span> <span style="color: #a9a1e1; font-style: italic;">pytest</span> .
<span style="color: #51afef; font-weight: bold;">==================</span> test session starts ==================
<span style="color: #51afef; font-weight: bold;">test_customer.py</span>
<span style="color: #51afef;">&gt;</span> /home/ahonnecke/src/blog/mocking_json/test_customer.py<span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">19</span><span style="color: #51afef;">)</span><span style="color: #51afef; font-weight: bold;">test_customer</span><span style="color: #51afef;">()</span>-<span style="color: #51afef;">&gt;</span>None
<span style="color: #51afef; font-weight: bold;">-</span><span style="color: #51afef;">&gt;</span> breakpoint<span style="color: #51afef;">()</span>
<span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">Pdb</span><span style="color: #51afef;">)</span> print<span style="color: #51afef;">(</span>customers<span style="color: #51afef;">)</span>
<span style="color: #51afef;">[</span>
    Customer<span style="color: #c678dd;">(</span>
        <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"aopjSxhgSTqWATggcDml"</span>,
        <span style="color: #dcaeea;">email</span>=<span style="color: #98be65;">"LzDicaTzPTgxHPEOyhFy"</span>,
        <span style="color: #dcaeea;">role</span>=<span style="color: #98be65;">"otJqpbeNjjRFSdvcoaWO"</span>,
        <span style="color: #dcaeea;">customer_id</span>=1896,
    <span style="color: #c678dd;">)</span>,
    Customer<span style="color: #c678dd;">(</span>
        <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"nvqooVXmZVzaYPWKZgSz"</span>,
        <span style="color: #dcaeea;">email</span>=<span style="color: #98be65;">"PBDygYKPQGZMLTbHFCVb"</span>,
        <span style="color: #dcaeea;">role</span>=<span style="color: #98be65;">"eDGHYCsSxchsKNwdcVDR"</span>,
        <span style="color: #dcaeea;">customer_id</span>=5242,
    <span style="color: #c678dd;">)</span>,
    Customer<span style="color: #c678dd;">(</span>
        <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"lDcjZAQarzSrReNAtCCB"</span>,
        <span style="color: #dcaeea;">email</span>=<span style="color: #98be65;">"QaTevLqUWPgsBSSvsthM"</span>,
        <span style="color: #dcaeea;">role</span>=<span style="color: #98be65;">"iAdOjDkrjZsBmFTamHwf"</span>,
        <span style="color: #dcaeea;">customer_id</span>=9581,
    <span style="color: #c678dd;">)</span>,
    Customer<span style="color: #c678dd;">(</span>
        <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"pfXuKloegkcnsDeAQKxx"</span>,
        <span style="color: #dcaeea;">email</span>=<span style="color: #98be65;">"ifaWVKWTpJMIukaJtJfV"</span>,
        <span style="color: #dcaeea;">role</span>=<span style="color: #98be65;">"NElmZelZqHupYuqVvIZf"</span>,
        <span style="color: #dcaeea;">customer_id</span>=7674,
    <span style="color: #c678dd;">)</span>,
    Customer<span style="color: #c678dd;">(</span>
        <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"EvAMzosabwOrKcXEsMjr"</span>,
        <span style="color: #dcaeea;">email</span>=<span style="color: #98be65;">"IXNVyOElYOCwwJLeTBmD"</span>,
        <span style="color: #dcaeea;">role</span>=<span style="color: #98be65;">"YNxfpRclnbLNNUSRJJRN"</span>,
        <span style="color: #dcaeea;">customer_id</span>=6280,
    <span style="color: #c678dd;">)</span>,
<span style="color: #51afef;">]</span>
<span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">Pdb</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Performing some trivial inspection of the resulting array of objects yields some populated data with sane-ish defaults:
This gives us an arbitrary number of objects, with differing, albeit nonsensical data.
</p>
</div>
</div>
</div>
</div>
