auto_model_generation.org
** Applying shape to the data with faker
Sometimes, a plain string or int is not enough, fortunately we can overwrite the mock data with yet another library from the ecosystem, `faker`.  I'm omitting the install step this time, and we will be altering non-generated code in the factory.  We're going to leave the customer id alone, but impose some structure on the remaining values.  I'm using faker here (because it's straightforward), but factory boy and other fuzzy mock data solutions can make this more robust.

#+begin_src python
from customer_model import Customer
from pydantic_factories import ModelFactory

from faker import Faker

FAKE = Faker() # Seed the fake data generator

class MockCustomerFactory(ModelFactory):
    __model__ = Customer

    email: str = FAKE.email()
    name: str = FAKE.name()
    role: str = FAKE.job()
#+end_src

Which will generate objects that look more like real data (below), but for a large majority of the uses, a random string will suffice.

#+begin_src python
Customer(
        name="Elizabeth Rush",
        email="michael72@example.org",
        role="Geneticist, molecular",
        customer_id=7732,
    ),
#+end_src

** Benefits of Using Mock Data
Using mock data generated from pydantic models has several benefits:

    - It allows us to generate an arbitrary number of valid instantiations of a given model that match the shape of the original JSON data.
    - It encourages the use of objects instead of dicts, which reduces data mutability and allows developers to write logic for well-formed models, making the code more stable and deterministic.
    - It provides intrinsic motivation for developers to use structured models in place of mutable dicts, and it does this by making it easy to write tests because the models are almost free.
    - It provides the ability to write and perform tests that use a large number of models with the same shape, but unique data values.
    - It allows for strongly typing model variables, which enables static type checking with mypy and better autocompletion. This allows developers to focus on the intent of their code rather than the mechanics of how it works.

** I was promised complex data
If I'm going to have to manually write my mock factories, then what am I generating data for in the first place?

When this process was first designed, it was used to map a very extensive, and frankly exhaustive data set for basic safety message payloads (the ones emitted by connected vehicle) and other specs that are very long and dry.  Those are so long and dry that they are actually a bit long for this post, so I went looking for some nested json, and came across the blob below (which I think we can all agree is long enough) that should expose the power of this process.

Here's some donut defining json I found, and

#+begin_src json /donut.json
{
    "id": "0001",
    "type": "donut",
    "name": "Cake",
    "ppu": 0.55,
    "batters": {
        "batter": [{
                "id": "1001",
                "type": "Regular"
            },
            {
                "id": "1002",
                "type": "Chocolate"
            },
            {
                "id": "1003",
                "type": "Blueberry"
            },
            {
                "id": "1004",
                "type": "Devil's Food"
            }
        ]
    },
    "topping": [{
            "id": "5001",
            "type": "None"
        },
        {
            "id": "5002",
            "type": "Glazed"
        },
        {
            "id": "5005",
            "type": "Sugar"
        },
        {
            "id": "5007",
            "type": "Powdered Sugar"
        },
        {
            "id": "5006",
            "type": "Chocolate with Sprinkles"
        },
        {
            "id": "5003",
            "type": "Chocolate"
        },
        {
            "id": "5004",
            "type": "Maple"
        }
    ]
}
#+end_src

If you will recall the generate script from above, we simply add one line:

#+begin_src bash /generate.sh
#!/usr/bin/env bash

generate() {
    datamodel-codegen \
        --input '$1' \
        --input-file-type json \
        --class-name '$2' \
        --snake-case-field \
        --allow-population-by-field-name \
        --output '$3'
}

generate "customer.json" "BaseCustomer" "base_customer.py"
generate "donut.json" "BaseDonut" "base_donut.py" # Add the donut generation line
#+end_src

#+begin_src python /base_donut.py
from __future__ import annotations

from typing import List

from pydantic import BaseModel


class BatterItem(BaseModel):
    class Config:
        allow_population_by_field_name = True

    id: str
    type: str


class Batters(BaseModel):
    class Config:
        allow_population_by_field_name = True

    batter: List[BatterItem]


class ToppingItem(BaseModel):
    class Config:
        allow_population_by_field_name = True

    id: str
    type: str


class BaseDonut(BaseModel):
    class Config:
        allow_population_by_field_name = True

    id: str
    type: str
    name: str
    ppu: float
    batters: Batters
    topping: List[ToppingItem]
#+end_src

As you can likely see, this model creation engine will now accept any well structured payload and create models and factories quite rapidly.  Feel free to try it out with something painfully complex!

Nevermind! You don't have to because I already did!  I searched stack overflow for "super complex json", pasted into the project and roughly 2 minutes later:

