auto_model_generation.html


<div id="outline-container-orgec5efab" class="outline-2">
<h2 id="orgec5efab"><span class="section-number-2">3.</span> Applying shape to the data with faker</h2>
<div class="outline-text-2" id="text-3">
<p>
Sometimes, a plain string or int is not enough, fortunately we can overwrite the mock data with yet another library from the ecosystem, `faker`.  I&rsquo;m omitting the install step this time, and we will be altering non-generated code in the factory.  We&rsquo;re going to leave the customer id alone, but impose some structure on the remaining values.  I&rsquo;m using faker here (because it&rsquo;s straightforward), but factory boy and other fuzzy mock data solutions can make this more robust.
</p>

<p>
Which will generate objects that look more like real data (below), but for a large majority of the uses, a random string will suffice.
</p>
</div>
</div>

<div id="outline-container-org61faeef" class="outline-2">
<h2 id="org61faeef"><span class="section-number-2">4.</span> Benefits of Using Mock Data</h2>
<div class="outline-text-2" id="text-4">
<p>
Using mock data generated from pydantic models has several benefits:
</p>

<ul class="org-ul">
<li>It allows us to generate an arbitrary number of valid instantiations of a given model that match the shape of the original JSON data.</li>
<li>It encourages the use of objects instead of dicts, which reduces data mutability and allows developers to write logic for well-formed models, making the code more stable and deterministic.</li>
<li>It provides intrinsic motivation for developers to use structured models in place of mutable dicts, and it does this by making it easy to write tests because the models are almost free.</li>
<li>It provides the ability to write and perform tests that use a large number of models with the same shape, but unique data values.</li>
<li>It allows for strongly typing model variables, which enables static type checking with mypy and better autocompletion. This allows developers to focus on the intent of their code rather than the mechanics of how it works.</li>
</ul>
</div>
</div>

<div id="outline-container-org2df73b7" class="outline-2">
<h2 id="org2df73b7"><span class="section-number-2">5.</span> I was promised complex data</h2>
<div class="outline-text-2" id="text-5">
<p>
If I&rsquo;m going to have to manually write my mock factories, then what am I generating data for in the first place?
</p>

<p>
When this process was first designed, it was used to map a very extensive, and frankly exhaustive data set for basic safety message payloads (the ones emitted by connected vehicle) and other specs that are very long and dry.  Those are so long and dry that they are actually a bit long for this post, so I went looking for some nested json, and came across the blob below (which I think we can all agree is long enough) that should expose the power of this process.
</p>

<p>
Here&rsquo;s some donut defining json I found, and
</p>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #bbc2cf; background-color: #282c34;">{</span>
    <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"0001"</span>,
    <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"donut"</span>,
    <span style="color: #51afef;">"name"</span>: <span style="color: #98be65;">"Cake"</span>,
    <span style="color: #51afef;">"ppu"</span>: <span style="color: #a9a1e1;">0.55</span>,
    <span style="color: #51afef;">"batters"</span>: <span style="color: #bbc2cf; background-color: #282c34;">{</span>
        <span style="color: #51afef;">"batter"</span>: <span style="color: #bbc2cf; background-color: #282c34;">[{</span>
                <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"1001"</span>,
                <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Regular"</span>
            <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
            <span style="color: #bbc2cf; background-color: #282c34;">{</span>
                <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"1002"</span>,
                <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Chocolate"</span>
            <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
            <span style="color: #bbc2cf; background-color: #282c34;">{</span>
                <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"1003"</span>,
                <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Blueberry"</span>
            <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
            <span style="color: #bbc2cf; background-color: #282c34;">{</span>
                <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"1004"</span>,
                <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Devil's Food"</span>
            <span style="color: #bbc2cf; background-color: #282c34;">}</span>
        <span style="color: #bbc2cf; background-color: #282c34;">]</span>
    <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
    <span style="color: #51afef;">"topping"</span>: <span style="color: #bbc2cf; background-color: #282c34;">[{</span>
            <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"5001"</span>,
            <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"None"</span>
        <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
        <span style="color: #bbc2cf; background-color: #282c34;">{</span>
            <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"5002"</span>,
            <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Glazed"</span>
        <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
        <span style="color: #bbc2cf; background-color: #282c34;">{</span>
            <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"5005"</span>,
            <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Sugar"</span>
        <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
        <span style="color: #bbc2cf; background-color: #282c34;">{</span>
            <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"5007"</span>,
            <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Powdered Sugar"</span>
        <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
        <span style="color: #bbc2cf; background-color: #282c34;">{</span>
            <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"5006"</span>,
            <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Chocolate with Sprinkles"</span>
        <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
        <span style="color: #bbc2cf; background-color: #282c34;">{</span>
            <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"5003"</span>,
            <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Chocolate"</span>
        <span style="color: #bbc2cf; background-color: #282c34;">}</span>,
        <span style="color: #bbc2cf; background-color: #282c34;">{</span>
            <span style="color: #51afef;">"id"</span>: <span style="color: #98be65;">"5004"</span>,
            <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"Maple"</span>
        <span style="color: #bbc2cf; background-color: #282c34;">}</span>
    <span style="color: #bbc2cf; background-color: #282c34;">]</span>
<span style="color: #bbc2cf; background-color: #282c34;">}</span>
</pre>
</div>

<p>
If you will recall the generate script from above, we simply add one line:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #5B6268;">#!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #5B6268;"> bash</span>

<span style="color: #c678dd;">generate</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef; font-weight: bold;">datamodel-codegen</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--input</span> <span style="color: #98be65;">'$1'</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--input-file-type</span> json <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--class-name</span> <span style="color: #98be65;">'$2'</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--snake-case-field</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--allow-population-by-field-name</span> <span style="color: #98be65;">\</span>
        <span style="color: #a9a1e1;">--output</span> <span style="color: #98be65;">'$3'</span>
<span style="color: #51afef;">}</span>

<span style="color: #51afef; font-weight: bold;">generate</span> <span style="color: #98be65;">"customer.json"</span> <span style="color: #98be65;">"BaseCustomer"</span> <span style="color: #98be65;">"base_customer.py"</span>
<span style="color: #51afef; font-weight: bold;">generate</span> <span style="color: #98be65;">"donut.json"</span> <span style="color: #98be65;">"BaseDonut"</span> <span style="color: #98be65;">"base_donut.py"</span> <span style="color: #5B6268;"># Add the donut generation line</span>
</pre>
</div>

<p>
As you can likely see, this model creation engine will now accept any well structured payload and create models and factories quite rapidly.  Feel free to try it out with something painfully complex!
</p>

<p>
Nevermind! You don&rsquo;t have to because I already did!  I searched stack overflow for &ldquo;super complex json&rdquo;, pasted into the project and roughly 2 minutes later:
</p>
</div>
